spec/fixtures/resources/defaultimpl/idempotence_rejected.json

{
	"errorId": "2c164323-20d3-4e9e-8578-dc562cd7506c-0000003c",
	"errors": [
		{
			"code": "21000020",
			"requestId": "2001798",
			"message": "VALUE **************** OF FIELD CREDITCARDNUMBER DID NOT PASS THE LUHNCHECK"
		}
	],
	"paymentResult": {
		"creationOutput": {
			"additionalReference": "00000200002014254436",
			"externalReference": "000002000020142544360000100001"
		},
		"payment": {
			"id": "1_1",
			"paymentOutput": {
				"amountOfMoney": {
					"amount": 2345,
					"currencyCode": "EUR"
				},
				"references": {
					"paymentReference": "0"
				},
				"paymentMethod": "card",
				"cardPaymentMethodSpecificOutput": {
					"paymentProductId": 1
				}
			},
			"status": "REJECTED",
			"statusOutput": {
				"errors": [
					{
						"code": "21000020",
						"requestId": "2001798",
						"message": "VALUE **************** OF FIELD CREDITCARDNUMBER DID NOT PASS THE LUHNCHECK"
					}
				],
				"isCancellable": false,
				"statusCode": 2,
				"statusCodeChangeDateTime": "20200101120000",
				"isAuthorized": false
			}
		}
	}
}
